# -*- coding: utf-8 -*-
"""
Created on Wed Aug  8 17:33:33 2018

@author: Minh Tuấn1
"""

# =============================================================================
# string = input().lower()
# string = list(string)
# list1 = []
# lib = ["a","o","y","e","u","i"]
# for i in string:
#     if i in lib:
#         del(i)
#     elif i not in lib:
#         list1.append(i)
#         au = "."+".".join(list1)
# print(au)
#         
# =============================================================================

# =============================================================================
# nub = input()
# nub = nub.split(" ")
# mul = (int(nub[0]) * int(nub[1]))
# if mul % 2 != 0: 
#     eq = (mul -1)/2
#     print(int(eq))
# else: 
#     eq = mul/2
#     print(int(eq))
# =============================================================================

# =============================================================================
# sol = []
# pc = int(input())
# for i in range(pc): 
#     solution = input()
#     sol.append(solution)
# so = []
# lis1= []
# for i in sol:
#     i = i.split(",")
#     for row in i: 
#         row = row.split(" ").count('1')
#     so.append(row) 
# for i in so: 
#     i = int(i)
#     if i >=2 : 
#         lis1.append(i)    
# print(len(lis1))
# =============================================================================

# =============================================================================
# nub = int(input())
# mm = []
# for i in range(nub): 
#     ab = input()
#     mm.append(ab)
# list1=[]
# for i in mm:
#     if i == "X++" or i == "++X":
#         i = + 1
#         list1.append(i)
#     elif i == "X--" or i == "--X": 
#         i = - 1
#         list1.append(i)
#     num = sum(list1)
# print(num)
# =============================================================================

# =============================================================================
# def split(a):
#     a1 = list(a)
#     b1 = a1.count(1)
#     b2 = a1.count(0)
#     lis1 = []
#     if b1 >= 7 and b2 <= 7: 
#         c1 = a.split("0")
#         lis1.append(c1)
#     elif b1 <=7 and b2 >= 7: 
#         c2 = a.split("1")
#         lis1.append(c2)
#     elif b1 <=7 and b2<= 7: 
#         print("NO")
#     else: 
#         
# print(split("0000000100001111"))
# 
# =============================================================================
# =============================================================================
# nub = input()
# sp = nub.split("1")
# list1 = []
# for i in sp: 
#     if len(i) >= 7: 
#         i = "YES"
#         list1.append(i)
#     else:
#         i = "NO"
#         list1.append(i)
# print(list1[0])
# =============================================================================



# =============================================================================
# a = input()
# if '1111111' in a or '000000' in a: 
#     print("yes")
# else: 
#     print("no")
# =============================================================================

# =============================================================================
# a = input().lower()
# b = input().lower()
# if a[-1] > b[-1]:
#     print(1)
# elif a[-1] < b[-1]: 
#     print(-1)
# else: 
#     print(0)
# 
# =============================================================================

a = input()
a = a.split("+")
b = sorted(a)
b = "+".join(b)
print(b)